; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (p7 ?x ?y)
		(p4 ?c)
		(p2 ?l)
		(p1 ?l)
		(p3 ?c ?l)
		(p5)
		(p6 ?c))

   (:action a3
       :parameters  (?from ?to)
       :precondition (and (p7 ?from ?to) 
                          (p2 ?from) (p2 ?to) (p1 ?from))
       :effect (and  (p1 ?to)
		     (not (p1 ?from))))


   (:action a2
       :parameters (?p4 ?loc)
       :precondition  (and  (p4 ?p4) (p2 ?loc)
			    (p3 ?p4 ?loc) (p1 ?loc) (p5))
       :effect (and (p6 ?p4)
		    (not (p3 ?p4 ?loc)) 
		    (not (p5))))

   (:action a1
       :parameters  (?p4  ?loc)
       :precondition  (and  (p4 ?p4) (p2 ?loc)
			    (p6 ?p4) (p1 ?loc))
       :effect (and (p3 ?p4 ?loc)
		    (p5)
		    (not (p6 ?p4)))))

; problem
(define (problem ferry-l4-o5)
(:domain ferry)
(:objects o4 o6 o1 o7 
          o2 o3 
)
(:init
(p2 o4)
(p2 o6)
(p2 o1)
(p2 o7)
(p4 o2)
(p4 o3)
(p7 o4 o6)
(p7 o6 o4)
(p7 o4 o1)
(p7 o1 o4)
(p7 o4 o7)
(p7 o7 o4)
(p7 o6 o1)
(p7 o1 o6)
(p7 o6 o7)
(p7 o7 o6)
(p7 o1 o7)
(p7 o7 o1)
(p5)
(p3 o2 o4)
(p3 o3 o4)
(p1 o4)
)
(:goal
(and
(p3 o2 o7)
(p3 o3 o1)
)
)

(:constraints
  (and
    (sometime-before  (p3 o2 o7) (p1 o6))
    (sometime-before  (p3 o3 o1) (p1 o6))
  )
)
)

; plan
1. (a2 o2 o4)
   deleted: (p3 o2 o4) (p5)
   added: (p6 o2)
   goals met: 0 of 2
2. (a3 o4 o1)
   deleted: (p1 o4)
   added: (p1 o1)
   goals met: 0 of 2
3. (a1 o2 o1)
   deleted: (p6 o2)
   added: (p3 o2 o1) (p5)
   goals met: 0 of 2
4. (a3 o1 o4)
   deleted: (p1 o1)
   added: (p1 o4)
   goals met: 0 of 2
5. (a2 o3 o4)
   deleted: (p3 o3 o4) (p5)
   added: (p6 o3)
   goals met: 0 of 2
6. (a3 o4 o6)
   deleted: (p1 o4)
   added: (p1 o6)
   goals met: 0 of 2
7. (a1 o3 o6)
   deleted: (p6 o3)
   added: (p3 o3 o6) (p5)
   goals met: 0 of 2
8. (a3 o6 o1)
   deleted: (p1 o6)
   added: (p1 o1)
   goals met: 0 of 2
9. (a2 o2 o1)
   deleted: (p3 o2 o1) (p5)
   added: (p6 o2)
   goals met: 0 of 2
10. (a3 o1 o7)
   deleted: (p1 o1)
   added: (p1 o7)
   goals met: 0 of 2
11. (a1 o2 o7)
   deleted: (p6 o2)
   added: (p3 o2 o7) (p5)
   goals met: 1 of 2
12. (a3 o7 o6)
   deleted: (p1 o7)
   added: (p1 o6)
   goals met: 1 of 2
13. (a2 o3 o6)
   deleted: (p3 o3 o6) (p5)
   added: (p6 o3)
   goals met: 1 of 2
14. (a3 o6 o1)
   deleted: (p1 o6)
   added: (p1 o1)
   goals met: 1 of 2
15. (a1 o3 o1)
   deleted: (p6 o3)
   added: (p3 o3 o1) (p5)
   goals met: 2 of 2
